tutorials/compressible/rhoPisoFoam/ras/cavity/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00325;

boundaryField
{
    movingWall
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.00325;
    }
    fixedWalls
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.00325;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
